https://www.geeksforgeeks.org/adding-new-column-to-existing-dataframe-in-pandas/

<h3 style="color:blue" align="left"> Column Addition </h3>

Adding new column to existing DataFrame in Pandas by below methods:

        1. By declaring a new list as a column

        2. By using DataFrame.insert()
        
        3. By Using Dataframe.assign()
        
        4. By using a dictionary

In [1]:
# Import pandas package  
import pandas as pd

In [2]:
# Define a dictionary containing Students data 

data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}

In [4]:
# Convert the dictionary into DataFrame

df = pd.DataFrame(data)
df

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           Msc
3    Anuj     5.2           Msc

<h3 style="color:blue" align="left"> 1. By declaring a new list as a column </h3>

In [5]:
# Declare a list that is to be converted into a column 
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']

In [6]:
# Using 'Address' as the column name 
# and equating it to the list

df['Address'] = address
df

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

-------------------------------------------------------------------------------------------------------------------------------

<h3 style="color:blue" align="left"> 2. By using DataFrame.insert( ) </h3>

In [7]:
# Using DataFrame.insert() to add a column

df.insert(2, "Age", [21, 23, 24, 21], True)
df

     Name  Height  Age Qualification    Address
0     Jai     5.1   21           Msc      Delhi
1  Princi     6.2   23            MA  Bangalore
2  Gaurav     5.1   24           Msc    Chennai
3    Anuj     5.2   21           Msc      Patna

-------------------------------------------------------------------------------------------------------------------------------

<h3 style="color:blue" align="left"> 3. By Using Dataframe.assign( ) </h3>

In [8]:
# Using 'Address' as the column name and equating it to the list

df2 = df.assign(address = ['Delhi', 'Bangalore', 'Chennai', 'Patna'])
df2

     Name  Height  Age Qualification    Address    address
0     Jai     5.1   21           Msc      Delhi      Delhi
1  Princi     6.2   23            MA  Bangalore  Bangalore
2  Gaurav     5.1   24           Msc    Chennai    Chennai
3    Anuj     5.2   21           Msc      Patna      Patna

-------------------------------------------------------------------------------------------------------------------------------

<h3 style="color:blue" align="left"> 4. By using a dictionary </h3>

In [9]:
# Define a dictionary with key values of 
# an existing column and their respective 
# value pairs as the # values for our new column.

address = {'Delhi': 'Jai', 'Bangalore': 'Princi', 
           'Patna': 'Gaurav', 'Chennai': 'Anuj'}

In [10]:
# Provide 'Address' as the column name

df['Address'] = address
df

     Name  Height  Age Qualification    Address
0     Jai     5.1   21           Msc      Delhi
1  Princi     6.2   23            MA  Bangalore
2  Gaurav     5.1   24           Msc      Patna
3    Anuj     5.2   21           Msc    Chennai